Revit 2026 API

# NonContinuousRailStructure Class

---

A class that represents a collection of Non-Continuous Rails being a part of Railing Type.

SystemObject Autodesk.Revit.DB.ArchitectureNonContinuousRailStructure

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class NonContinuousRailStructure : IDisposable
```
```vb
Public Class NonContinuousRailStructure
	Implements IDisposable
```
```cpp
public ref class NonContinuousRailStructure : IDisposable
```
```fsharp
type NonContinuousRailStructure =
    class
        interface IDisposable
    end
```

The NonContinuousRailStructure type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddNonContinuousRail | Creates and appends a new Non-Continuous Rail to the Rail Structure. The new Non-Continuous Rail will have the given name, height and offset. It will have default profile and material ElementIds. |
|  | Dispose | Releases all resources used by the NonContinuousRailStructure |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetNonContinuousRail | Gets the Non-Continuous Rail object of specified index from the Rail Structure. |
|  | GetNonContinuousRailCount | Gets number of Non-Continuous Rails. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidNonContinuousRailProfile | Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail. |
|  | RemoveNonContinuousRail | Removes Non-Continuous Rail from the Rail Structure. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Architecture Namespace